<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%policy_name%</name>
      <enabled>true</enabled>
      <trigger>EVENT</trigger>
      <trigger_checkin>false</trigger_checkin>
      <trigger_enrollment_complete>false</trigger_enrollment_complete>
      <trigger_login>false</trigger_login>
      <trigger_network_state_changed>false</trigger_network_state_changed>
      <trigger_startup>false</trigger_startup>
      <trigger_other>packagetest</trigger_other>
      <frequency>Once every day</frequency>
      <retry_event>none</retry_event>
      <retry_attempts>-1</retry_attempts>
      <notify_on_each_failed_retry>false</notify_on_each_failed_retry>
      <location_user_only>false</location_user_only>
      <target_drive>/</target_drive>
      <offline>false</offline>
      <category>
        <id>26</id>
        <name>Testing</name>
      </category>
      <date_time_limitations>
        <activation_date_epoch>0</activation_date_epoch>
        <expiration_date_epoch>0</expiration_date_epoch>
      </date_time_limitations>
      <network_limitations>
        <minimum_network_connection>No Minimum</minimum_network_connection>
        <any_ip_address>true</any_ip_address>
      </network_limitations>
      <override_default_settings>
        <target_drive>default</target_drive>
        <force_afp_smb>false</force_afp_smb>
        <sus>default</sus>
      </override_default_settings>
      <network_requirements>Any</network_requirements>
      <site>
        <id>1</id>
        <name>Learning Spaces</name>
      </site>
    </general>
    <scope>
      <all_computers>false</all_computers>
      <computers>
        <computer>
          <id>2238</id>
          <name>toff</name>
          <udid>32DB12C9-5A5E-55E1-A7EF-69AD198D00AC</udid>
        </computer>
        <computer>
          <id>1602</id>
          <name>Havilar</name>
          <udid>5C1A01E0-A186-5A09-B86F-2061481CDD30</udid>
        </computer>
      </computers>
      <computer_groups>
        <computer_group>
          <id>406</id>
          <name>Production Machines</name>
        </computer_group>
      </computer_groups>
    </scope>
    <self_service>
      <use_for_self_service>true</use_for_self_service>
      <self_service_display_name>Package Test</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <reinstall_button_text>Reinstall</reinstall_button_text>
      <self_service_description/>
      <force_users_to_view_description>false</force_users_to_view_description>
      <self_service_icon/>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories>
        <category>
          <id>26</id>
          <name>Testing</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
      <notification>false</notification>
      <notification>Self Service</notification>
      <notification_subject/>
      <notification_message/>
    </self_service>
    <package_configuration>
      <packages>
        <size>1</size>
        <package>
          <name>%pkg_name%</name>
          <action>Install</action>
          <fut>false</fut>
          <feu>false</feu>
          <update_autorun>false</update_autorun>
        </package>
      </packages>
    </package_configuration>
    <scripts>
      <size>0</size>
    </scripts>
    <printers>
      <size>0</size>
      <leave_existing_default/>
    </printers>
    <dock_items>
      <size>0</size>
    </dock_items>
    <account_maintenance>
      <accounts>
        <size>0</size>
      </accounts>
      <directory_bindings>
        <size>0</size>
      </directory_bindings>
      <management_account>
        <action>doNotChange</action>
      </management_account>
      <open_firmware_efi_password>
        <of_mode>none</of_mode>
        <of_password_sha256 since="9.23">e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855</of_password_sha256>
      </open_firmware_efi_password>
    </account_maintenance>
    <reboot>
      <message>This computer will restart in 5 minutes. Please save anything you are working on and log out by choosing Log Out from the bottom of the Apple menu.</message>
      <startup_disk>Current Startup Disk</startup_disk>
      <specify_startup/>
      <no_user_logged_in>Do not restart</no_user_logged_in>
      <user_logged_in>Do not restart</user_logged_in>
      <minutes_until_reboot>5</minutes_until_reboot>
      <start_reboot_timer_immediately>false</start_reboot_timer_immediately>
      <file_vault_2_reboot>false</file_vault_2_reboot>
    </reboot>
    <maintenance>
      <recon>false</recon>
      <reset_name>false</reset_name>
      <install_all_cached_packages>false</install_all_cached_packages>
      <heal>false</heal>
      <prebindings>false</prebindings>
      <permissions>false</permissions>
      <byhost>false</byhost>
      <system_cache>false</system_cache>
      <user_cache>false</user_cache>
      <verify>false</verify>
    </maintenance>
    <files_processes>
      <search_by_path/>
      <delete_file>false</delete_file>
      <locate_file/>
      <update_locate_database>false</update_locate_database>
      <spotlight_search/>
      <search_for_process/>
      <kill_process>false</kill_process>
      <run_command/>
    </files_processes>
    <user_interaction>
      <message_start/>
      <allow_users_to_defer>false</allow_users_to_defer>
      <allow_deferral_until_utc/>
      <allow_deferral_minutes>0</allow_deferral_minutes>
      <message_finish/>
    </user_interaction>
    <disk_encryption>
      <action>none</action>
    </disk_encryption>
  </policy>