<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%policy_name%</name>
      <enabled>true</enabled>
      <trigger>EVENT</trigger>
      <trigger_other>packagetest</trigger_other>
      <frequency>Ongoing</frequency>
      <category>
        <id>26</id>
        <name>Testing</name>
      </category>
      <site>
        <id>1</id>
        <name>Learning Spaces</name>
      </site>
    </general>
    <scope>
      <all_computers>false</all_computers>
      <computer_groups>
        <computer_group>
          <id>633</id>
          <name>Smart Production Machines</name>
        </computer_group>
        <computer_group>
          <id>730</id>
          <name>LS Testing Machines</name>
        </computer_group>
      </computer_groups>
    </scope>
    <self_service>
      <use_for_self_service>true</use_for_self_service>
      <self_service_display_name>%policy_name%</self_service_display_name>
      <self_service_categories>
        <category>
          <id>26</id>
          <name>Testing</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
    <package_configuration>
      <packages>
        <size>1</size>
        <package>
          <name>%pkg_name%</name>
          <action>Install</action>
        </package>
      </packages>
      <distribution_point>default</distribution_point>
    </package_configuration>
    <maintenance>
      <recon>true</recon>
    </maintenance>
  </policy>
