<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.jchutc0.autopkg-uploaders.VueScan.jamf-upload</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.pkg.VueScan</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Device Drivers</string>
		<key>NAME</key>
		<string>VueScan</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>postprocessors</key>
	<array>
		<string>com.github.jchutc0.autopkg-uploaders.copyAndUpload</string>
	</array>
</dict>
</plist>
